
/**
 * @file
 * Contains js array for FL.ru filter.
 */

/**
 * First key means ID for All spec in this group.
 */
var filter_specs = [];
filter_specs[2] = [
  "Разработка сайтов",
  [
    [9, 'Веб-программирование'],
    [85, 'Копирайтинг'],
    [8, 'Верстка'],
    [3, 'Дизайн сайтов'],
    [27, 'Сайт «под ключ»'],
    [217, 'Интернет-магазины'],
    [164, 'Контент-менеджер'],
    [81, 'QA (тестирование)'],
    [84, 'Менеджер проектов'],
    [218, 'Проектирование'],
    [86, 'Системы администрирования (CMS)'],
    [220, 'Доработка сайтов'],
    [216, 'Адаптивный дизайн'],
    [219, 'Юзабилити-анализ'],
    [87, 'Флеш-сайты'],
    [72, 'Wap/PDA-сайты']
  ]
];
filter_specs[8] = [
  "Тексты",
  [
    [43, 'Копирайтинг'],
    [103, 'Редактирование/Корректура'],
    [107, 'Статьи'],
    [104, 'Рерайтинг'],
    [10, 'Контент-менеджер'],
    [200, 'Расшифровка аудио и видеозаписей'],
    [70, 'Сканирование и распознавание'],
    [108, 'Рефераты/Курсовые/Дипломы'],
    [44, 'Стихи/Поэмы/Эссе'],
    [105, 'Постинг'],
    [233, 'Тексты на иностранных языках'],
    [40, 'Тексты/Речи/Рапорты'],
    [202, 'Создание субтитров'],
    [203, 'Сценарии'],
    [39, 'Слоганы/Нейминг'],
    [41, 'Резюме'],
    [32, 'Новости/Пресс-релизы'],
    [106, 'ТЗ/Help/Мануал']
  ]
];
filter_specs[3] = [
  "Дизайн и Арт",
  [
    [172, 'Дизайн сайтов'],
    [46, 'Логотипы'],
    [48, 'Рисунки и иллюстрации'],
    [49, 'Полиграфический дизайн'],
    [50, 'Интерьеры'],
    [45, 'Баннеры'],
    [15, 'Векторная графика'],
    [18, 'Фирменный стиль'],
    [170, 'Живопись'],
    [91, '2D Персонажи'],
    [132, 'Хенд-мейд'],
    [19, 'Презентации'],
    [51, 'Дизайн упаковки'],
    [75, 'Наружная реклама'],
    [17, '2D Анимация'],
    [80, 'Ландшафтный дизайн/Генплан'],
    [208, 'Трикотажный и текстильный дизайн'],
    [167, '3D Персонажи'],
    [168, '3D Иллюстрации'],
    [47, 'Иконки'],
    [239, 'Дизайн интерфейсов приложений'],
    [35, 'Интерфейсы'],
    [240, 'Концепт-арт'],
    [52, 'Промышленный дизайн'],
    [88, 'Комиксы'],
    [4, 'Технический дизайн'],
    [79, 'Пиксел-арт'],
    [169, 'Граффити'],
    [128, 'Дизайн выставочных стендов'],
    [173, 'Картография'],
    [238, 'Инфографика'],
    [78, 'Разработка шрифтов'],
    [171, 'Аэрография'],
    [205, 'Дизайнер машинной вышивки']
  ]
];
filter_specs[5] = [
  "Программирование",
  [
    [37, 'Веб-программирование'],
    [1, 'Прикладное программирование'],
    [82, 'QA (тестирование)'],
    [97, '1С-программирование'],
    [131, 'Системный администратор'],
    [5, 'Базы данных'],
    [11, 'Программирование игр'],
    [2, 'Системное программирование'],
    [6, 'Программирование для сотовых телефонов и КПК'],
    [222, 'Разработка CRM и ERP'],
    [31, 'Защита информации'],
    [133, 'Проектирование'],
    [161, 'Встраиваемые системы'],
    [221, 'Плагины/Сценарии/Утилиты'],
    [223, 'Интерактивные приложения'],
    [213, 'Макросы для игр'],
    [224, 'Управление проектами разработки']
  ]
];
filter_specs[13] = [
  "Аутсорсинг и консалтинг",
  [
    [121, 'Бухгалтерия'],
    [120, 'Юриспруденция'],
    [254, 'Ввод и обработка данных/текста'],
    [126, 'Переводы/Тексты'],
    [211, 'Репетиторы / Преподаватели'],
    [127, 'Реклама/Маркетинг'],
    [241, 'Обработка заказов'],
    [68, 'Бизнес-консультирование'],
    [122, 'Разработка сайтов'],
    [256, 'Обработка писем'],
    [124, 'Программирование'],
    [242, 'Обслуживание клиентов и поддержка'],
    [244, 'Техническая поддержка'],
    [123, 'Дизайн/Арт'],
    [212, 'Финансовый консультант'],
    [251, 'Кадровый учет и зарплата'],
    [125, 'Оптимизация (SEO)'],
    [243, 'Поддержка по телефону'],
    [255, 'Виртуальный ассистент'],
    [253, 'Статистический анализ'],
    [252, 'Обработка платежей'],
    [176, 'Системы управления предприятием (ERP-системы)'],
    [119, 'Юзабилити']
  ]
];
filter_specs[7] = [
  "Переводы",
  [
    [235, 'Перевод текстов общей тематики '],
    [12, 'Технический перевод'],
    [13, 'Художественный перевод'],
    [234, 'Локализация ПО, сайтов и игр'],
    [102, 'Корреспонденция/Деловая переписка'],
    [237, 'Редактирование переводов'],
    [236, 'Устный перевод']
  ]
];
filter_specs[11] = [
  "Аудио/Видео",
  [
    [117, 'Видеомонтаж'],
    [24, 'Музыка/Звуки'],
    [162, 'Диктор'],
    [25, 'Аудиомонтаж'],
    [73, 'Видеодизайн'],
    [163, 'Видеосъемка'],
    [201, 'Создание субтитров'],
    [266, 'Видеопрезентации'],
    [264, 'Видеоинфографика'],
    [268, 'Режиссура'],
    [265, 'Кастинг'],
    [175, 'Свадебное видео'],
    [267, 'Раскадровки']
  ]
];
filter_specs[16] = [
  "Разработка игр",
  [
    [158, 'Рисунки и иллюстрации'],
    [152, '3D Моделирование'],
    [272, 'Тестирование игр (QA)'],
    [154, 'Программирование игр'],
    [153, '2D Анимация'],
    [151, '3D Анимация'],
    [271, 'Озвучивание игр'],
    [157, 'Пиксел-арт'],
    [156, 'Flash/Flex-программирование'],
    [214, 'Макросы для игр'],
    [155, 'Концепт/Эскизы'],
    [270, 'Видеоролики']
  ]
];
filter_specs[12] = [
  "Реклама и Маркетинг",
  [
    [245, 'SMM (маркетинг в соцсетях)'],
    [118, 'Контекстная реклама'],
    [67, 'Сбор и обработка информации'],
    [247, 'Креатив'],
    [248, 'Продажи и генерация лидов'],
    [59, 'PR-менеджмент'],
    [246, 'Исследования рынка и опросы'],
    [56, 'Рекламные концепции'],
    [250, 'Телемаркетинг и продажи по телефону'],
    [65, 'Организация мероприятий'],
    [66, 'Исследования'],
    [42, 'Бизнес-планы'],
    [188, 'SMO'],
    [249, 'Промо-персонал'],
    [21, 'Медиапланирование']
  ]
];
filter_specs[10] = [
  "Фотография",
  [
    [55, 'Ретуширование/Коллажи'],
    [71, 'Художественная/Арт'],
    [112, 'Рекламная/Постановочная'],
    [114, 'Мероприятия/Репортажи'],
    [160, 'Модели'],
    [159, 'Свадебная фотосъемка'],
    [115, 'Архитектура/Интерьер'],
    [274, 'Промышленная фотосъемка']
  ]
];
filter_specs[19] = [
  "Анимация и флеш",
  [
    [184, 'Музыка/Звуки'],
    [96, 'Флеш-баннеры'],
    [185, 'Баннеры'],
    [183, '2D Персонажи'],
    [180, '2D Анимация'],
    [181, '3D Анимация'],
    [182, '3D Персонажи'],
    [94, 'Флеш-сайты'],
    [95, 'Flash/Flex-программирование'],
    [269, 'Гейм-арт'],
    [7, 'Флеш-графика'],
    [130, '2D Флеш-aнимация'],
    [186, 'Сценарии для анимации'],
    [178, 'Виртуальные туры'],
    [187, 'Раскадровки']
  ]
];
filter_specs[9] = [
  "3D Графика",
  [
    [109, '3D Моделирование'],
    [146, 'Интерьеры'],
    [149, 'Видеодизайн'],
    [16, '3D Анимация'],
    [110, '3D Персонажи'],
    [147, 'Экстерьеры'],
    [148, 'Предметная визуализация'],
    [150, '3D Иллюстрации']
  ]
];
filter_specs[20] = [
  "Инжиниринг",
  [
    [89, 'Чертежи/Схемы'],
    [141, 'Конструкции'],
    [193, 'Электрика'],
    [196, 'Машиностроение'],
    [194, 'Слаботочные сети/Автоматизация'],
    [259, 'Сметы '],
    [191, 'Отопление/Вентиляция'],
    [258, 'Разработка радиоэлектронных систем'],
    [192, 'Водоснабжение/Канализация'],
    [195, 'Технология'],
    [257, 'Газоснабжение ']
  ]
];
filter_specs[22] = [
  "Обучение и консультации",
  [
    [210, 'Рефераты / Курсовые / Дипломы'],
    [209, 'Репетиторы / Преподаватели'],
    [206, 'Психолог'],
    [262, 'Иностранные языки'],
    [261, 'Дошкольное образование '],
    [260, 'Гуманитарные дисциплины '],
    [263, 'Технические дисциплины '],
    [204, 'Путешествия'],
    [207, 'Стилист']
  ]
];
filter_specs[14] = [
  "Архитектура/Интерьер",
  [
    [144, 'Интерьеры'],
    [93, 'Архитектура'],
    [190, 'Визуализация/3D'],
    [143, 'Ландшафтный дизайн/Генплан'],
    [189, 'Макетирование']
  ]
];
filter_specs[1] = [
  "Менеджмент",
  [
    [36, 'Менеджер проектов'],
    [61, 'Менеджер по продажам'],
    [63, 'Менеджер по персоналу'],
    [129, 'Арт-директор'],
    [215, 'Управление репутацией онлайн']
  ]
];
filter_specs[17] = [
  "Полиграфия",
  [
    [166, 'Полиграфический дизайн'],
    [174, 'Дизайн упаковки'],
    [90, 'Полиграфическая верстка'],
    [92, 'Допечатная подготовка'],
    [273, 'Верстка электронных изданий'],
    [165, 'Разработка шрифтов']
  ]
];
filter_specs[6] = [
  "Оптимизация (SEO)",
  [
    [98, 'Контекстная реклама'],
    [34, 'Поисковые системы'],
    [100, 'Контент'],
    [101, 'SMO'],
    [198, 'SEM'],
    [99, 'Продажа ссылок']
  ]
];
filter_specs[23] = [
  "Мобильные приложения",
  [
    [225, 'Google Android'],
    [226, 'iOS'],
    [228, 'Дизайн'],
    [227, 'Windows Phone'],
    [229, 'Прототипирование']
  ]
];
filter_specs[24] = [
  "Сети и инфосистемы",
  [
    [232, 'Сетевое администрирование'],
    [231, 'Администрирование баз данных'],
    [230, 'ERP и CRM интеграции']
  ]
];
